zup/ЗУП_бюджет/src/InformationRegisters/СвойстваДолжностейГосударственнойСлужбы/СвойстваДолжностейГосударственнойСлужбы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваДолжностейГосударственнойСлужбы</name>
  <resources>
    <name>ВидДолжностиГосударственнойСлужбы</name>
    <type>
      <types>EnumRef.ВидыДолжностейГосударственнойСлужбы</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияДолжностиГосударственнойСлужбы</name>
    <type>
      <types>EnumRef.КатегорииДолжностейГосударственнойСлужбы</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаДолжностиГосударственнойСлужбы</name>
    <type>
      <types>EnumRef.ГруппыДолжностейГосударственнойСлужбы</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяДолжностьюГосударственнойСлужбы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПомощникаЗамещающегоМуниципальнуюДолжность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПрокурора</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяДолжностьюВоеннойПравоохранительнойСлужбы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьСудьи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПрокурораСледователяСудьи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИсчислениеСтраховогоСтажаПФРГосударственнойДолжности</name>
    <type>
      <types>CatalogRef.ЗамещениеГосударственныхМуниципальныхДолжностейПФР</types>
    </type>
  </resources>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

zup/ЗУП_бюджет/src/Enums/ВидыДолжностейГосударственнойСлужбы/ВидыДолжностейГосударственнойСлужбы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДолжностейГосударственнойСлужбы</name>
  <enumValues>
    <name>ДолжностьГосударственнойГражданскойСлужбы</name>
  </enumValues>
  <enumValues>
    <name>ГосударственнаяДолжность</name>
  </enumValues>
  <enumValues>
    <name>НеЯвляетсяДолжностьюГосударственнойСлужбы</name>
  </enumValues>
  <enumValues>
    <name>ДолжностьМуниципальнойСлужбы</name>
  </enumValues>
  <enumValues>
    <name>МуниципальнаяДолжность</name>
  </enumValues>
  <enumValues>
    <name>НеЯвляетсяДолжностьюМуниципальнойСлужбы</name>
  </enumValues>
  <enumValues>
    <name>ВоинскаяДолжность</name>
  </enumValues>
  <enumValues>
    <name>ДолжностьПравоохранительнойСлужбы</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/InformationRegisters/СвойстваДолжностейГосударственнойСлужбы/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьРасчетДенежногоСодержанияПрокуроров = ПолучитьФункциональнуюОпцию("ИспользоватьРасчетДенежногоСодержанияПрокуроров"); 
	ИспользоватьРасчетДенежногоСодержанияСудей 	= ПолучитьФункциональнуюОпцию("ИспользоватьРасчетДенежногоСодержанияСудей");
	
	ОтносятсяКСлужбе = Новый Массив;
	ОтносятсяКСлужбе.Добавить(Перечисления.ВидыДолжностейГосударственнойСлужбы.ГосударственнаяДолжность);
	ОтносятсяКСлужбе.Добавить(Перечисления.ВидыДолжностейГосударственнойСлужбы.ДолжностьГосударственнойГражданскойСлужбы);
	ОтносятсяКСлужбе.Добавить(Перечисления.ВидыДолжностейГосударственнойСлужбы.МуниципальнаяДолжность);
	ОтносятсяКСлужбе.Добавить(Перечисления.ВидыДолжностейГосударственнойСлужбы.ДолжностьМуниципальнойСлужбы);
	
	ОтноситсяКВоеннойСлужбе = Новый Массив;
	ОтноситсяКВоеннойСлужбе.Добавить(Перечисления.ВидыДолжностейГосударственнойСлужбы.ВоинскаяДолжность);
	ОтноситсяКВоеннойСлужбе.Добавить(Перечисления.ВидыДолжностейГосударственнойСлужбы.ДолжностьПравоохранительнойСлужбы);
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Запись.ЯвляетсяДолжностьюГосударственнойСлужбы = ОтносятсяКСлужбе.Найти(Запись.ВидДолжностиГосударственнойСлужбы) <> Неопределено;
		Запись.ЯвляетсяДолжностьюВоеннойПравоохранительнойСлужбы = ОтноситсяКВоеннойСлужбе.Найти(Запись.ВидДолжностиГосударственнойСлужбы) <> Неопределено;
		Запись.ДолжностьПрокурораСледователяСудьи = (ИспользоватьРасчетДенежногоСодержанияПрокуроров И Запись.ДолжностьПрокурора) ИЛИ
			(ИспользоватьРасчетДенежногоСодержанияСудей И Запись.ДолжностьСудьи);
	КонецЦикла;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.АвтоматическийРасчетСтажейФизическихЛиц") Тогда
		
		МодульАвтоматическийРасчетСтажейФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("АвтоматическийРасчетСтажейФизическихЛиц");
		МодульАвтоматическийРасчетСтажейФизическихЛиц.ЗапомнитьСвойстваДолжностейСАвтоматическимРасчетомСтажей(
			ЭтотОбъект, Отказ, "ЯвляетсяДолжностьюГосударственнойСлужбы,ЯвляетсяДолжностьюВоеннойПравоохранительнойСлужбы");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.АвтоматическийРасчетСтажейФизическихЛиц") Тогда
		
		МодульАвтоматическийРасчетСтажейФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("АвтоматическийРасчетСтажейФизическихЛиц");
		МодульАвтоматическийРасчетСтажейФизическихЛиц.ЗаполнитьЗависимыеСтажиДолжностей(ЭтотОбъект, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
